#### WallCrossSection Enumeration

---

|  |
| --- |
| See Also |

The allowed values for the WALL\_CROSS\_SECTION parameter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public enum WallCrossSection ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WallCrossSection ``` |

| Visual C++ |
| --- |
| ``` public enum class WallCrossSection ``` |

# Members

| Member name | Description |
| --- | --- |
| SingleSlanted | A single-slanted wall whose angle is controlled by the parameter WALL\_SINGLE\_SLANT\_ANGLE\_FROM\_VERTICAL. |
| Vertical | A vertical wall, 0 degrees. |
| Tapered | A tapered wall whose angle is controlled by the parameters WALL\_TAPERED\_EXTERIOR\_INWARD\_ANGLE and WALL\_TAPERED\_INTERIOR\_INWARD\_ANGLE. |

# See Also

Autodesk.Revit.DB Namespace